tutorials/compressible/DBNS/explicitDBNSSolver/2DRiemann800/constant/thermophysicalProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          thermophysicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

// name, nMoles, mol weight, CP, Hf, mu, Pr;
// mixture         air 1 28.9 1007 0 0 0.7;
// mixture         air 1 11640.2561438975 2.5 0 0 0.7;

mixture
{
    specie
    {
        nMoles          1;
        molWeight       11640.3;
    }
    thermodynamics
    {
        Cp              2.5;
        Hf              0;
    }
    transport
    {
        mu              0;
        Pr              0.7;
    }
}


// ************************************************************************* //
