tutorials/compressible/DBNS/explicitDBNSSolver/2DRiemann800/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver    diagonal;
    };

    rhoU
    {
        solver    diagonal;
    };

    rhoE
    {
        solver    diagonal;
    };

    p
    {
        solver    diagonal;
    };

    U
    {
        solver    diagonal;
    };

    T
    {
        solver    diagonal;
    };
}

// ************************************************************************* //
